In [23]:
import pandas as pd
import numpy as np
import sqlalchemy
import mysql.connector
from sqlalchemy import create_engine

In [25]:
host = "localhost"
user = "root"
password = "qiwoqqwu"
database = "WEEK9"
try:
    connection = mysql.connector.connect(
        host = host,
        user = user,
        password = password,
        database = database
    )
    if connection.is_connected():
        print(f"ket noi thanh cong ")
        cursor = connection.cursor()

except mysql.connector.Error as e:
    print(f"loi ")

ket noi thanh cong

In [20]:
cursor = connection.cursor()
cursor.execute("""CREATE DATABASE IF NOT EXISTS WEEK9
                  DEFAULT CHARACTER SET utf8mb4
                  COLLATE utf8mb4_unicode_ci""")

In [9]:
engine = create_engine("mysql+mysqlconnector://root:qiwoqqwu@localhost/WEEK9")

In [22]:
cursor = connection.cursor()
cursor.execute("""Create table if not exists BANKING(
               Customer_id INT AUTO_INCREMENT  PRIMARY KEY,
               name varchar(20) not null,
               city varchar(15)not null)
               """)

In [23]:
cursor.execute("DROP TABLE IF EXISTS BANKING")

In [24]:
cursor = connection.cursor()
cursor.execute("""Create table if not exists customers(
               Customer_id INT AUTO_INCREMENT  PRIMARY KEY,
               name varchar(20) not null,
               city varchar(15)not null)
               """)

In [29]:
cursor = connection.cursor()
cursor.execute("""
    CREATE TABLE IF NOT EXISTS Accounts (
        Account_ID VARCHAR(10) PRIMARY KEY,
        Customer_id INT NOT NULL,
        balance DECIMAL(10, 2) NOT NULL,
        FOREIGN KEY (Customer_id) REFERENCES customers(customer_id)
    )
""")

In [42]:
cursor = connection.cursor()
cursor.execute("""
    CREATE TABLE IF NOT EXISTS Accounts (
        Account_ID VARCHAR(10) PRIMARY KEY,
        Customer_id INT NOT NULL,
        balance DECIMAL(10, 2) NOT NULL,
        FOREIGN KEY (Customer_id) REFERENCES customers(customer_id)
    )
""")

In [41]:
cursor.execute("DROP TABLE IF EXISTS Accounts")

In [29]:
cursor.execute("SELECT * FROM Accounts WHERE Account_ID = 'A1'")
existing_data = cursor.fetchall()
print(existing_data)

[]

In [31]:
cursor.execute("SELECT * FROM Accounts")
data = cursor.fetchall()
print(data)

[('A2', 1, Decimal('1000.00')), ('A3', 2, Decimal('1500.00'))]

In [24]:
cursor.execute("DELETE FROM Accounts WHERE Account_ID = 'A1'")
connection.commit()

In [6]:
cursor.execute("DROP TABLE IF EXISTS Accounts;")
print("Bảng Accounts đã bị xóa.")

Bảng Accounts đã bị xóa.

In [36]:
cursor.execute("SELECT * FROM customers;")
customers = cursor.fetchall()
print(customers)  # In danh sách khách hàng hiện có

[(1, 'Alice', 'Ha noi'), (2, 'Bob', 'HCM'), (3, 'Charlie', 'Da Nang'), (4, 'Diana', 'Ha noi')]

In [8]:
# Tạo lại bảng Accounts
cursor.execute("""
    CREATE TABLE IF NOT EXISTS Accounts (
        Account_ID VARCHAR(10)  PRIMARY KEY,
        Customer_id INT NOT NULL,
        balance DECIMAL(10, 2) NOT NULL,
        FOREIGN KEY (Customer_id) REFERENCES customers(customer_id)
    )
""")
print("Bảng 'Accounts' đã được tạo lại.")

Bảng 'Accounts' đã được tạo lại.

In [39]:
cursor.execute("DELETE FROM Accounts")
connection.commit()
print("Đã xóa hết dữ liệu trong bảng Accounts.")

Đã xóa hết dữ liệu trong bảng Accounts.

In [11]:
cursor.execute("SELECT * FROM Accounts")  # Giả sử bạn có câu lệnh SELECT nào đó trước đó
cursor.fetchall()  # Đọc kết quả để giải phóng kết quả chưa đọc

[('A1', 1, Decimal('500.00')),
 ('A2', 1, Decimal('1000.00')),
 ('A3', 2, Decimal('1500.00'))]

In [12]:
cursor.execute("DELETE FROM Accounts")
connection.commit()
print("Dữ liệu đã được xóa khỏi bảng Accounts.")

Dữ liệu đã được xóa khỏi bảng Accounts.

In [10]:
cursor.execute("SELECT * FROM Customers")  # Giả sử bạn có câu lệnh SELECT nào đó trước đó
cursor.fetchall()  # Đọc kết quả để giải phóng kết quả chưa đọc

[(1, 'Alice', 'Ha noi'),
 (2, 'Bob', 'HCM'),
 (3, 'Charlie', 'Da Nang'),
 (4, 'Diana', 'Ha noi')]

In [13]:
account_data = [
    ("A1", 1, 500),  
    ("A2", 1, 1000),  
    ("A3", 2, 1500),  
    ("A4", 4, 300)    
]

# Chèn dữ liệu vào bảng Accounts
for account in account_data:
    cursor.execute("INSERT INTO Accounts (Account_ID, Customer_id, balance) VALUES (%s, %s, %s)", account)

# Xác nhận thay đổi
connection.commit()
print("Dữ liệu đã được chèn vào bảng Accounts.")

Dữ liệu đã được chèn vào bảng Accounts.

In [17]:
# Chèn một tài khoản mới vào bảng Accounts cho khách hàng Bob (Customer_id = 2)
account_data_single = [
    ("A5", 2, 2500),  # Tài khoản cho Bob
]

# Chèn tài khoản vào bảng Accounts
for account in account_data_single:
    cursor.execute("INSERT INTO Accounts (Account_ID, Customer_id, balance) VALUES (%s, %s, %s)", account)

# Xác nhận thay đổi
connection.commit()
print("Dữ liệu tài khoản đã được chèn vào bảng Accounts.")

Dữ liệu tài khoản đã được chèn vào bảng Accounts.

Viết truy vấn liệt kê tất cả khách hàng và các tài khoản nếu có. sử dụng left join thay cho inner vì có 1 người số 5 nhưng vì mình chèn nhầm

In [20]:
query1a = ('''select A.account_id,C.name,C.Customer_id From Accounts as A LEFT Join Customers as C On A.Customer_id = C.Customer_id''')
df1a=pd.read_sql(query1a,engine)
print(df1a)

  account_id   name  Customer_id
0         A1  Alice            1
1         A2  Alice            1
2         A3    Bob            2
3         A5    Bob            2
4         A4  Diana            4

In [26]:
# Đoạn mã để xóa khóa ngoại trong bảng Accounts
cursor.execute("""
    ALTER TABLE Accounts
    DROP FOREIGN KEY accounts_ibfk_1;
""")
connection.commit()
print("Khóa ngoại đã được xóa thành công.")

Khóa ngoại đã được xóa thành công.

In [32]:
# Lấy dữ liệu từ bảng Accounts
cursor.execute("SELECT * FROM Accounts")
accounts_data = cursor.fetchall()

# In dữ liệu
for row in accounts_data:
    print(row)

('A1', 1, Decimal('500.00'))
('A2', 1, Decimal('1000.00'))
('A3', 2, Decimal('1500.00'))
('A4', 4, Decimal('300.00'))
('A5', 2, Decimal('2500.00'))
('A6', 5, Decimal('300.00'))

In [27]:
# Kiểm tra cấu trúc của bảng Accounts
cursor.execute("SHOW CREATE TABLE Accounts")
create_table_info = cursor.fetchone()
print(create_table_info)

('Accounts', 'CREATE TABLE `accounts` (\n  `Account_ID` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,\n  `Customer_id` int NOT NULL,\n  `balance` decimal(10,2) NOT NULL,\n  PRIMARY KEY (`Account_ID`),\n  KEY `Customer_id` (`Customer_id`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci')

In [30]:
# Thêm tài khoản có Customer_id không tồn tại trong bảng Customers
cursor.execute("INSERT INTO Accounts (Account_ID, Customer_id, balance) VALUES ('A6', 5, 300)")
connection.commit()
print("Đã thêm tài khoản A4 với Customer_id không tồn tại.")

Đã thêm tài khoản A4 với Customer_id không tồn tại.

In [62]:
query1a = ('''select A.account_id,C.name,C.Customer_id From Accounts as A LEFT Join Customers as C On A.Customer_id = C.Customer_id''')
df1a=pd.read_sql(query1a,engine)
df1a.tail()

  account_id   name  Customer_id
1         A2  Alice          1.0
2         A3    Bob          2.0
3         A5    Bob          2.0
4         A4  Diana          4.0
5         A6   None          NaN

In [61]:
query1a = ('''  SELECT C.Customer_id, C.name
                FROM Customers C
                WHERE C.Customer_id IN (
                                                SELECT A.Customer_id
                                                    FROM Accounts A
                                                );

''')
df1a=pd.read_sql(query1a,engine)
df1a.tail()

   Customer_id   name
0            1  Alice
1            2    Bob
2            4  Diana

In [60]:
query1a = ('''  SELECT C.Customer_id, C.name, 
    (SELECT A.Account_ID 
     FROM Accounts A 
     WHERE A.Customer_id = C.Customer_id 
     LIMIT 1) AS Account_ID
FROM Customers C;

''')
df1a=pd.read_sql(query1a,engine)
df1a.tail()

   Customer_id     name Account_ID
0            1    Alice         A1
1            2      Bob         A3
2            3  Charlie       None
3            4    Diana         A4

Viết truy vấn chỉ hiển thị khách hàng có ít nhất một tài khoản

In [59]:
query1b = ('''  
    SELECT C.Customer_id, C.name
    FROM Customers C
    INNER JOIN Accounts A ON A.Customer_id = C.Customer_id
    GROUP BY C.Customer_id, C.name
    HAVING COUNT(A.Account_ID) >= 1;
''')
df1b = pd.read_sql(query1b, engine)
df1b.tail()

   Customer_id   name
0            1  Alice
1            2    Bob
2            4  Diana

Viết truy vấn hiển thị tất cả tài khoản, kể cả không biết thuộc khách hàng nào

In [53]:
query1c = ('''SELECT A.Account_ID, A.Customer_id, A.balance, C.name
              FROM Accounts AS A
              LEFT JOIN Customers AS C ON A.Customer_id = C.Customer_id''')

df1c = pd.read_sql(query1c, engine)
df1c.tail()

  Account_ID  Customer_id  balance   name
1         A2            1   1000.0  Alice
2         A3            2   1500.0    Bob
3         A4            4    300.0  Diana
4         A5            2   2500.0    Bob
5         A6            5    300.0   None

Viết truy vấn liệt kê toàn bộ kết hợp giữa khách hàng và tài khoản (mọi tổ hợp).

In [54]:
query1d =(''' SELECT C.Customer_id, C.name, A.Account_ID, A.balance
FROM Customers C
CROSS JOIN Accounts A;
''')
df1d=pd.read_sql(query1d,engine)
df1d.tail()

    Customer_id     name Account_ID  balance
19            1    Alice         A5   2500.0
20            4    Diana         A6    300.0
21            3  Charlie         A6    300.0
22            2      Bob         A6    300.0
23            1    Alice         A6    300.0

In [55]:
query1e =('''SELECT C.customer_id , C.Name 
          FROM Customers as C 
          LEFT JOIN Accounts as A ON C.Customer_ID = A.Customer_ID
          WHERE A.Customer_id IS NULL''')
df1e = pd.read_sql(query1e,engine)
df1e.tail()

   customer_id     Name
0            3  Charlie

In [58]:
query1f =('''SELECT A.Account_ID , A.customer_ID , A.balance
          FROM accounts as A 
          left Join customers as C
            on A.customer_id = c.customer_id
          Where C.Customer_ID is null''')
df1f = pd.read_sql(query1f,engine)
df1f.tail()

  Account_ID  customer_ID  balance
0         A6            5    300.0